DBPATH = "sqlite:///data/Users_data.db"

ADMINS = [754826030]

ECODEDEGREES = ['Нулевая', 'Очень низкая', 'Низкая', 'Средняя', 'Высокая', 'Очень высокая']

PREMIUMLIMIT = 100

ADDITIVELIMIT = 3

TESS_CONFIG = r'--psm 6 --oem 3'

DESCRIPTION1 = 'Привет, {user_name}✨ Я - Telegram бот, который сможет помочь тебе в выборе качественных продуктов питания!'
DESCRIPTION2 = 'Просто пришли в чат фото или текст состава продукта, я расскажу всё о е-добавках!'

FEEDBACKTEXT = 'Ответь пожалуйста в отзыве на 2 вопроса:'

QUEST1 = '1) Веришь ли ты в мою пользу?'
QUEST2 = '2) Хотел бы продолжить пользоваться мной, почему?'

PREMIUMTERMS = 'Я уберу ограничения на размер твоего чёрного списка, но взамен оставь отзыв пожалуйста)'

BLACKLISTOVERFLOW1 = 'К сожалению, ты добавил максимальное количество элементов чёрного списка('
BLACKLISTOVERFLOW2 = 'Отправь заявку на premium, а ещё пришли пожалуйста честный отзыв обо мне)'


BLACKLIST = 'Чёрный список'

PREMIUM = 'Премиум'

FEEDBACK = 'Оставить отзыв'

ECODEDESCRIPTION = '''
Название:
{e_name} ({e_number})

Вредность:
{harm}

Свойства:
{feature}

Использование:
{usage}

Влияние на организм:
{influence}
'''
